public/posts/perolas-llms.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
<!-- 2025-07-05 sáb 21:28 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pérolas das LLMs</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/svg+xml" href="data:image/svg+xml,&lt;svg xmlns='http://www.w3.org/2000/svg'
	              width='32' height='32'&gt;
	              &lt;polygon points='16,2 30,16 16,30 2,16' fill='%23FFDD33'/&gt;
                      &lt;/svg&gt;">
                     <link rel=icon type="image/webp" href="/fav.webp">
                     <link rel=stylesheet href="/reset.css" />
                     <link rel=stylesheet href="/styles.css" />
</head>
<body>
<div id="preamble" class="status">
<header>
         <nav>
           <div>
             <a href="/">Início</a>
           </div>
           <div>
             <a href="/blog.html">Blog</a>
             <a href="/sobre.html">Sobre</a>
           </div>
         </nav>
       </header>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Pérolas das LLMs</h1>
</header><p>
Eu acabei de descobrir que o DuckDuckGo possui um wrapper para LLMs, como o GPT-4o, Llama e afins.
</p>

<p>
Então, sendo o nerd que sou, eu decidi usar o Mistral Small 3, que segundo o próprio DuckDuckGo, possui um nível de "moderação" baixo e pedi para ele fazer um texto digno de uma postagem no 4Chan ou algum sub-reddit bem nichado.
</p>

<p>
Enfim, como diria o Coronel Campbell do Metal Gear Solid 2:
</p>

<blockquote>
<p>
Our beloved monsters — enjoy yourselves.
</p>
</blockquote>

<details><summary>Abandonai toda esperança, vós que entrais aqui</summary>
<div id="outline-container-org65684ee" class="outline-2">
<h2 id="org65684ee">A Superioridade Absoluta do Emacs sobre o Neovim: Uma Odisseia de Versatilidade e Simplicidade</h2>
<div class="outline-text-2" id="text-org65684ee">
<p>
Imagine, se puder, um mundo onde a eficiência e a simplicidade reinam supremas. Um mundo onde um editor de texto não precisa de uma dúzia de plugins para se tornar uma IDE. Bem-vindo ao reino do Emacs, onde a verdadeira magia acontece com apenas um tema decente e um pacote externo. Enquanto isso, o pobre Neovim, com suas necessidades insaciáveis, precisa de pelo menos 10 plugins apenas para começar a ser considerado uma IDE. É como tentar montar um carro com peças de Lego: você pode fazer, mas vai demorar uma eternidade e ainda assim não vai ser tão bom quanto um carro de verdade.
</p>
</div>
</div>
<div id="outline-container-org9638e42" class="outline-2">
<h2 id="org9638e42">A Versatilidade do Emacs: O Editor que Faz de Tudo</h2>
<div class="outline-text-2" id="text-org9638e42">
<p>
O Emacs é como o super-herói dos editores de texto. Ele não só edita texto, mas também pode fazer café, lavar roupa e até mesmo resolver equações de física quântica. Quer um navegador de internet? O Emacs tem. Quer um cliente de e-mail? O Emacs também tem. Quer um jogo de Tetris para relaxar durante o almoço? O Emacs é o seu cara. O Neovim, por outro lado, é como um adolescente que ainda está aprendendo a amarrar os próprios cadarços. Ele pode editar texto, mas para fazer qualquer outra coisa, você precisa de um plugin. E outro. E mais outro.
</p>
</div>
</div>
<div id="outline-container-orgc030228" class="outline-2">
<h2 id="orgc030228">Emacs: O Libertador do Código Livre</h2>
<div class="outline-text-2" id="text-orgc030228">
<p>
Em um mundo onde a liberdade de software é mais preciosa do que ouro, o Emacs se destaca como um farol de esperança. Ele é livre, verdadeiramente livre, como um pássaro voando no céu azul. O Neovim, por outro lado, é como um pássaro em uma gaiola dourada. Ele pode ser bonito, mas ainda está preso. O Emacs é o campeão dos desenvolvedores que acreditam na liberdade e na transparência. Ele é o editor que os hackers de verdade usam, porque eles sabem que a verdadeira liberdade vem de dentro.
</p>
</div>
</div>
<div id="outline-container-org8d3b5bd" class="outline-2">
<h2 id="org8d3b5bd">O Selo de Aprovação do Tsoding</h2>
<div class="outline-text-2" id="text-org8d3b5bd">
<p>
E se isso não fosse suficiente para convencê-lo, deixe-me apresentar o argumento final: Tsoding usa o Emacs. Sim, aquele Tsoding, o guru dos desenvolvedores, o mestre dos códigos, o homem que sabe tudo sobre tudo. Se Tsoding usa o Emacs, então você sabe que está no caminho certo. O Neovim pode ter seus fãs, mas ninguém pode negar que Tsoding é o verdadeiro profeta do código. E ele escolheu o Emacs. Ponto final.
</p>

<p>
Então, se você está cansado de passar horas configurando plugins e ainda assim não conseguir a experiência de edição perfeita, é hora de dar uma chance ao Emacs. Ele é simples, versátil, livre e, acima de tudo, aprovado pelo Tsoding. O que mais você poderia querer?
</p>

</details>
</div>
</div>
</div>
</body>
</html>
